{
  "layout": "scrolled",
  "schema": {
    "type": "webPage",
    "prop": {
      "additionalType": "PrivacyPolicy"
    }
  },
  "head": {
    "canonical": "/legal/privacy-policy/",
    "description": "We prioritize your privacy. Explore our concise and clear privacy policy to understand how we handle and protect your information.",
    "thumbnail": "https://cdn.merylldindin.com/thumbnails/privacy-policy-20260202T111103.webp",
    "title": "Privacy Policy | Meryll Dindin"
  },
  "components": [
    {
      "name": "LEGAL_SECTION",
      "id": "privacy-policy",
      "props": {
        "title": "Privacy Policy",
        "date": "Last updated on February 11, 2026",
        "content": [
          { "type": "subtitle", "content": "Introduction" },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "Meryll Dindin (''we'', ''us'', or ''our'') operates the website located at "
              },
              {
                "type": "a",
                "content": "merylldindin.com",
                "props": { "to": "/", "underlined": true }
              },
              {
                "type": "p",
                "content": " (the ''Site''). This Privacy Policy explains how we collect, use, disclose, and safeguard your information when you visit our Site. We are committed to protecting your privacy in accordance with the General Data Protection Regulation (GDPR), the California Consumer Privacy Act as amended by the California Privacy Rights Act (CCPA/CPRA), and other applicable data protection laws."
              }
            ]
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "Please read this Privacy Policy carefully. By accessing or using the Site, you acknowledge that you have read, understood, and agree to be bound by this Privacy Policy. If you do not agree, please do not access or use the Site."
              }
            ]
          },
          { "type": "subtitle", "content": "Information We Collect" },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "We collect information in two categories: information collected automatically and information you provide voluntarily."
              }
            ]
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "Automatically Collected Information: When you visit our Site, certain information is collected automatically through cookies and similar tracking technologies. This includes your IP address, browser type and version, operating system, referring URLs, pages visited, time spent on pages, click patterns, and other browsing behavior data. This information is collected primarily through Google Analytics 4 (measurement ID: G-YJHQMGJVMX)."
              }
            ]
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "Voluntarily Provided Information: If you contact us via email, we may collect your name, email address, and the content of your communication. We do not operate user accounts, registration forms, or newsletter signups on this Site."
              }
            ]
          },
          { "type": "subtitle", "content": "How We Use Your Information" },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "We use the information we collect for the following purposes: (1) to operate, maintain, and improve the Site and its content; (2) to analyze usage patterns, traffic sources, and user behavior to enhance the user experience; (3) to monitor and ensure the security and integrity of the Site; (4) to respond to your inquiries or communications; and (5) to comply with legal obligations and enforce our terms."
              }
            ]
          },
          { "type": "subtitle", "content": "Legal Basis for Processing (GDPR)" },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "For visitors in the European Economic Area (EEA) and the United Kingdom, we process personal data under the following legal bases: (1) Legitimate Interests — we have a legitimate interest in understanding how visitors use our Site to improve content and user experience; (2) Consent — where required by applicable law, we obtain your consent before placing non-essential cookies or processing your data for analytics purposes; and (3) Legal Obligation — we may process data to comply with applicable legal requirements."
              }
            ]
          },
          { "type": "subtitle", "content": "Cookies and Analytics" },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "We use Google Analytics 4 (GA4) to collect and analyze information about the use of our Site. GA4 uses first-party cookies to measure user interactions. GA4 collects data such as pages viewed, session duration, approximate geographic location (based on IP address), device and browser information, and traffic sources. Google may use this data in accordance with its own privacy policy."
              }
            ]
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "We have configured GA4 with IP anonymization enabled by default. We do not use Google Analytics advertising features, and we do not link analytics data with personally identifiable information."
              }
            ]
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "You can opt out of Google Analytics tracking by installing the "
              },
              {
                "type": "a",
                "content": "Google Analytics Opt-out Browser Add-on",
                "props": {
                  "external": true,
                  "to": "https://tools.google.com/dlpage/gaoptout",
                  "rel": "noopener noreferrer",
                  "target": "_blank",
                  "underlined": true
                }
              },
              {
                "type": "p",
                "content": ", or by adjusting your browser's cookie settings to block cookies from Google Analytics."
              }
            ]
          },
          { "type": "subtitle", "content": "Third-Party Services" },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "Our Site uses the following third-party services: (1) Google Analytics 4 — for web analytics and usage statistics; (2) Amazon CloudFront — as a content delivery network (CDN) to serve static assets and images efficiently. These services may collect technical information as described in their respective privacy policies. We do not sell, rent, or trade your personal information to any third party."
              }
            ]
          },
          { "type": "subtitle", "content": "International Data Transfers" },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "Your information may be transferred to and processed in countries other than your country of residence, including the United States, where our hosting and analytics services operate. These countries may have data protection laws that differ from your jurisdiction. Where required, we rely on appropriate safeguards such as Standard Contractual Clauses approved by the European Commission to ensure that your data is protected in accordance with applicable law."
              }
            ]
          },
          { "type": "subtitle", "content": "Data Retention" },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "Analytics data collected through Google Analytics is retained for a period of 14 months, after which it is automatically deleted. Any personal data you provide through direct communication (such as email) is retained only as long as necessary to respond to your inquiry and for our legitimate record-keeping purposes, after which it is securely deleted."
              }
            ]
          },
          { "type": "subtitle", "content": "Your Rights" },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "Under the GDPR (for EEA and UK residents): You have the right to access the personal data we hold about you; the right to rectification of inaccurate or incomplete data; the right to erasure (''right to be forgotten''); the right to data portability; the right to restrict processing; the right to object to processing based on legitimate interests; and the right to withdraw consent at any time where processing is based on consent. You also have the right to lodge a complaint with your local supervisory authority."
              }
            ]
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "Under the CCPA/CPRA (for California residents): You have the right to know what personal information is collected, used, shared, or sold; the right to delete personal information held by us; the right to opt out of the sale or sharing of personal information (note: we do not sell or share personal information as defined by the CCPA/CPRA); and the right to non-discrimination for exercising your privacy rights. We will not discriminate against you for exercising any of these rights."
              }
            ]
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "To exercise any of these rights, please contact us using the information provided in the Contact section below. We will respond to verified requests within the timeframes required by applicable law (generally within 30 days for GDPR requests and 45 days for CCPA/CPRA requests)."
              }
            ]
          },
          { "type": "subtitle", "content": "Children's Privacy" },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "Our Site is not directed at children under the age of 13 (or 16 in the EEA). We do not knowingly collect personal information from children. In compliance with the Children's Online Privacy Protection Act (COPPA), if we become aware that we have inadvertently collected personal information from a child under the applicable age, we will take steps to delete such information promptly. If you believe we may have collected information from a child, please contact us immediately."
              }
            ]
          },
          { "type": "subtitle", "content": "Security" },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "We implement reasonable technical and organizational security measures to protect your information from unauthorized access, alteration, disclosure, or destruction. Our Site is served over HTTPS with TLS encryption. However, no method of transmission over the Internet or method of electronic storage is completely secure, and we cannot guarantee absolute security."
              }
            ]
          },
          { "type": "subtitle", "content": "Changes to This Privacy Policy" },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "We may update this Privacy Policy from time to time to reflect changes in our practices, applicable laws, or for other operational, legal, or regulatory reasons. When we make material changes, we will update the ''Last updated'' date at the top of this page. We encourage you to review this Privacy Policy periodically. Your continued use of the Site after any changes constitutes your acceptance of the updated Privacy Policy."
              }
            ]
          },
          { "type": "subtitle", "content": "Contact" },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "If you have any questions, concerns, or requests regarding this Privacy Policy or our data practices, please contact us via "
              },
              {
                "type": "a",
                "content": "email",
                "props": {
                  "external": true,
                  "to": "mailto:merylldindin@icloud.com",
                  "rel": "noopener noreferrer",
                  "target": "_blank",
                  "underlined": true
                }
              },
              {
                "type": "p",
                "content": ". We will endeavor to respond to all legitimate requests in a timely manner."
              }
            ]
          }
        ]
      }
    }
  ]
}
