{
  "layout": "scrolled",
  "head": {
    "canonical": "/legal/terms-of-use/",
    "title": "Navigating Our Website: Know Our Terms of Use | Meryll Dindin",
    "description": "Learn about the policies, user responsibilities, and terms of access that guide the use of Meryll Dindin's website. Familiarize yourself with our terms now."
  },
  "components": [
    {
      "name": "LEGAL_TEXT",
      "id": "privacy-policy",
      "props": {
        "title": "Terms of Use",
        "date": "Last updated on February 3, 2023",
        "content": [
          {
            "type": "subtitle",
            "content": "Introduction"
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "These terms of use (“Terms”) govern your access to and use of Meryll Dindin's website, including any content, functionality, and services offered on or through "
              },
              {
                "type": "a",
                "content": "merylldindin.com",
                "props": {
                  "to": "/"
                }
              },
              {
                "type": "p",
                "content": " (the “Site”), whether as a guest or a registered user."
              }
            ]
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "Please read these Terms carefully before you start to use the Site. By using the Site, you accept and agree to be bound and abide by these Terms and our Privacy Policy, found at "
              },
              {
                "type": "a",
                "content": "merylldindin.com/legal/privacy-policy",
                "props": {
                  "to": "/legal/privacy-policy/"
                }
              },
              {
                "type": "p",
                "content": ", incorporated herein by reference. If you do not want to agree to these Terms or the Privacy Policy, you must not access or use the Site."
              }
            ]
          },
          {
            "type": "subtitle",
            "content": "Intellectual Property"
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "The Site and its original content, features, and functionality are and will remain the exclusive property of Meryll Dindin's website and its licensors. The Site is protected by copyright, trademark, and other laws of both the United States and foreign countries. Our trademarks and trade dress may not be used in connection with any product or service without the prior written consent of Meryll Dindin's website."
              }
            ]
          },
          {
            "type": "subtitle",
            "content": "User Content"
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "The Site may allow you to submit, upload, publish, or otherwise make available content, including but not limited to text, photographs, videos, and audio (“User Content”). You retain all rights in, and are solely responsible for, the User Content you make available through the Site."
              }
            ]
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "By making any User Content available through the Site, you grant to Meryll Dindin's website a non-exclusive, transferable, sub-licensable, royalty-free, worldwide license to use, copy, modify, create derivative works based on, distribute, publicly display, publicly perform, and otherwise exploit in any manner such User Content in all formats and distribution channels now known or hereafter devised (including in connection with the Site and Meryll Dindin's business and on third-party sites and services), without further notice to or consent from you, and without the requirement of payment to you or any other person or entity."
              }
            ]
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "You represent and warrant that: (i) you either are the sole and exclusive owner of all User Content or you have all rights, licenses, consents, releases, and clearances to grant the rights granted in these Terms; and (ii) neither the User Content, your submission, upload, publication, or otherwise making available of such User Content, nor Meryll Dindin's website use of the User Content as permitted herein will infringe, misappropriate, or violate a third party’s patent, copyright, trademark, trade secret, moral rights, or proprietary or other proprietary rights, or result in the violation of any applicable law or regulation."
              }
            ]
          },
          {
            "type": "subtitle",
            "content": "User Conduct"
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "You agree not to engage in any of the following prohibited activities: (i) copying, distributing, or disclosing any part of the Site in any medium, including without limitation by any automated or non-automated “scraping”; (ii) using any automated system, including without limitation “robots,” “spiders,” “offline readers,” etc., to access the Site; (iii) transmitting spam, chain letters, or other unsolicited email; (iv) attempting to interfere with, compromise the system integrity or security, or decipher any transmissions to or from the servers running the Site; (v) taking any action that imposes, or may impose at our sole discretion an unreasonable or disproportionately large load on our infrastructure; (vi) uploading invalid data, viruses, worms, or other software agents through the Site; (vii) collecting or harvesting any personally identifiable information, including account names of others; (viii) using the Site for any commercial solicitation purposes; (ix) impersonating another person or entity, or falsifying your affiliation with a person or entity; (x) violating the privacy of any third party, or attempting to harvest or collect any personally identifiable information of users of the Site; or (xi) engaging in any other conduct that restricts or inhibits anyone's use or enjoyment of the Site, or which, as determined by Meryll Dindin's website, may harm Meryll Dindin's website or users of the Site or expose them to liability."
              }
            ]
          },
          {
            "type": "subtitle",
            "content": "Modifications to Site"
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "Meryll Dindin's website reserves the right to modify, suspend, or discontinue the Site or any portion thereof at any time with or without notice to you, and Meryll Dindin's will not be liable to you or to any third party should it exercise such rights."
              }
            ]
          },
          {
            "type": "subtitle",
            "content": "Modifications to Terms"
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "Meryll Dindin's website reserves the right, at its sole discretion, to modify or replace these Terms at any time. If a revision is material, Meryll Dindin's website will provide at least 30 days’ notice prior to any new terms taking effect. What constitutes a material change will be determined at Meryll Dindin's sole discretion. By continuing to access or use the Site after any revisions become effective, you agree to be bound by the revised terms. If you do not agree to the new terms, you are no longer authorized to use the Site."
              }
            ]
          },
          {
            "type": "subtitle",
            "content": "Termination"
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "Meryll Dindin's website may terminate or suspend your access to all or part of the Site, with or without notice and with or without cause, at any time and effective immediately. If you wish to terminate these Terms or your Meryll Dindin's website account (if you have one), you may discontinue using the Site."
              }
            ]
          },
          {
            "type": "subtitle",
            "content": "Disclaimers"
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "The Site is provided on an “AS IS” and “AS AVAILABLE” basis without any representation or warranty, whether express, implied, or statutory. Meryll Dindin's website makes no representation, warranty, or guarantee that the Site will be uninterrupted, timely, secure, or error-free."
              }
            ]
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "You understand that your use of the Site and any User Content is at your own risk. Meryll Dindin's website does not warrant that User Content, including without limitation any information provided through the Site, will be accurate, reliable, or complete, and Meryll Dindin's website will have no liability for any errors or omissions in the User Content."
              }
            ]
          },
          {
            "type": "subtitle",
            "content": "Indemnification"
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "You agree to indemnify, defend, and hold harmless Meryll Dindin's website, its affiliates, licensors, and service providers, and its and their respective officers, directors, employees, contractors, agents, licensors, suppliers, successors, assigns, content providers, and other agents from and against any claims, liabilities, damages, judgments, awards, losses, costs, expenses, or fees (including reasonable attorneys’ fees) arising out of your violation of these Terms or your use of the Site, including User Content submitted by you, or your violation of any rights of another."
              }
            ]
          },
          {
            "type": "subtitle",
            "content": "Governing Law and Jurisdiction"
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "These Terms and your use of the Site will be governed under Washington State law. Any dispute arising from these Terms or your use of the Site will be resolved exclusively in the courts located in Santa Monica, California, and you consent to the personal jurisdiction of such courts."
              }
            ]
          },
          {
            "type": "subtitle",
            "content": "Miscellaneous"
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "These Terms, together with the Privacy Policy and any additional terms to which you agree when using particular elements of the Site, constitute the entire agreement between you and Meryll Dindin's website with respect to the use of the Site. If any provision of these Terms is held to be invalid or unenforce to the enforceability of the remaining provisions. The failure of Meryll Dindin's website to enforce any right or provision in these Terms shall not constitute a waiver of such right or provision unless acknowledged and agreed to by us in writing."
              }
            ]
          },
          {
            "type": "subtitle",
            "content": "Contact Information"
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "If you have any questions or concerns about these Terms of Use, please contact us via "
              },
              {
                "type": "a",
                "content": "email",
                "props": {
                  "external": true,
                  "to": "mailto:merylldin@gmail.com",
                  "rel": "noopener noreferrer",
                  "target": "_blank",
                  "underlined": true
                }
              },
              {
                "type": "p",
                "content": "."
              }
            ]
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "These Terms of Use are effective as of February 3, 2023, and will remain in effect except with respect to any changes in its provisions in the future, which will be in effect immediately after being posted on this page."
              }
            ]
          }
        ]
      }
    }
  ]
}
