{
  "layout": "scrolled",
  "schema": {
    "type": "webPage",
    "prop": {
      "additionalType": "TermsOfService"
    }
  },
  "head": {
    "canonical": "/legal/terms-of-use/",
    "description": "Learn about the policies, user responsibilities, and terms of access that guide the use of Meryll Dindin's website. Familiarize yourself with our terms.",
    "thumbnail": "https://cdn.merylldindin.com/thumbnails/terms-of-use-20260202T111131.webp",
    "title": "Website Terms of Use | Meryll Dindin"
  },
  "components": [
    {
      "name": "LEGAL_SECTION",
      "id": "terms-of-use",
      "props": {
        "title": "Terms of Use",
        "date": "Last updated on February 11, 2026",
        "content": [
          { "type": "subtitle", "content": "Acceptance of Terms" },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "These Terms of Use (''Terms'') govern your access to and use of the website located at "
              },
              {
                "type": "a",
                "content": "merylldindin.com",
                "props": { "to": "/", "underlined": true }
              },
              {
                "type": "p",
                "content": " (the ''Site''), operated by Meryll Dindin (''we'', ''us'', or ''our''). By accessing or using the Site, you agree to be bound by these Terms and our "
              },
              {
                "type": "a",
                "content": "Privacy Policy",
                "props": { "to": "/legal/privacy-policy/", "underlined": true }
              },
              {
                "type": "p",
                "content": ", which is incorporated herein by reference. If you do not agree to these Terms, you must not access or use the Site."
              }
            ]
          },
          { "type": "subtitle", "content": "Eligibility" },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "The Site is intended for users who are at least 13 years of age. By using the Site, you represent and warrant that you are at least 13 years old. If you are under 13, you may not access or use the Site."
              }
            ]
          },
          { "type": "subtitle", "content": "Intellectual Property Rights" },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "The Site and its entire contents, features, and functionality — including but not limited to all text, articles, graphics, images, photographs, illustrations, software, code, designs, and the selection and arrangement thereof — are owned by Meryll Dindin or his licensors and are protected by United States and international copyright, trademark, patent, trade secret, and other intellectual property laws."
              }
            ]
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "You may not reproduce, distribute, modify, create derivative works of, publicly display, publicly perform, republish, download, store, or transmit any material from the Site, except as incidentally necessary for normal web browsing (such as temporary caching by your browser) or as expressly permitted by these Terms."
              }
            ]
          },
          { "type": "subtitle", "content": "Permitted Use" },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "You are granted a limited, non-exclusive, non-transferable, revocable license to access and use the Site for personal, non-commercial, informational purposes only. You may share links to the Site and quote brief excerpts with proper attribution, provided such use does not imply endorsement or affiliation."
              }
            ]
          },
          { "type": "subtitle", "content": "Prohibited Conduct" },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "You agree not to: (1) use the Site in any way that violates any applicable federal, state, local, or international law or regulation; (2) transmit any advertising, promotional material, spam, or unsolicited communications; (3) impersonate or attempt to impersonate Meryll Dindin, another user, or any other person or entity; (4) engage in any activity that interferes with or disrupts the Site or the servers and networks connected to the Site; (5) attempt to gain unauthorized access to any portion of the Site, other accounts, computer systems, or networks connected to the Site; (6) use any automated means, including robots, scrapers, or spiders, to access the Site for any purpose without our express written permission; (7) introduce any viruses, trojan horses, worms, logic bombs, or other malicious or technologically harmful material; or (8) collect or harvest any personally identifiable information from the Site."
              }
            ]
          },
          { "type": "subtitle", "content": "Third-Party Links" },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "The Site may contain links to third-party websites, services, or resources that are not owned or controlled by us. We have no control over and assume no responsibility for the content, privacy policies, or practices of any third-party websites or services. You acknowledge and agree that we are not responsible or liable for any damage or loss caused by or in connection with use of any such third-party content, goods, or services."
              }
            ]
          },
          { "type": "subtitle", "content": "AI-Generated Content" },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "Certain content on this Site, including images and supplementary text, may have been created or assisted by artificial intelligence (AI) tools and large language models (LLMs). While we strive for accuracy and quality, AI-generated content may contain errors, inaccuracies, or biases. Such content is provided ''as is'' and should not be relied upon as professional, medical, legal, or financial advice. We make no representations or warranties regarding the accuracy, completeness, or reliability of AI-generated content."
              }
            ]
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "This Site provides a machine-readable summary of its content via llms.txt for use by AI systems and language models. Use of this data is subject to these Terms, including the intellectual property restrictions herein."
              }
            ]
          },
          { "type": "subtitle", "content": "Disclaimer of Warranties" },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "THE SITE AND ITS CONTENT ARE PROVIDED ON AN ''AS IS'' AND ''AS AVAILABLE'' BASIS WITHOUT ANY WARRANTIES OF ANY KIND, WHETHER EXPRESS, IMPLIED, STATUTORY, OR OTHERWISE. WE SPECIFICALLY DISCLAIM ALL IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE, AND NON-INFRINGEMENT. WE DO NOT WARRANT THAT THE SITE WILL BE UNINTERRUPTED, TIMELY, SECURE, OR ERROR-FREE, OR THAT ANY DEFECTS WILL BE CORRECTED."
              }
            ]
          },
          { "type": "subtitle", "content": "Limitation of Liability" },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "TO THE FULLEST EXTENT PERMITTED BY APPLICABLE LAW, IN NO EVENT SHALL MERYLL DINDIN, HIS AFFILIATES, OR THEIR RESPECTIVE LICENSORS, SERVICE PROVIDERS, EMPLOYEES, AGENTS, OFFICERS, OR DIRECTORS BE LIABLE FOR ANY INDIRECT, INCIDENTAL, SPECIAL, CONSEQUENTIAL, OR PUNITIVE DAMAGES, INCLUDING BUT NOT LIMITED TO LOSS OF PROFITS, DATA, USE, GOODWILL, OR OTHER INTANGIBLE LOSSES, ARISING OUT OF OR IN CONNECTION WITH YOUR ACCESS TO OR USE OF (OR INABILITY TO ACCESS OR USE) THE SITE, WHETHER BASED ON WARRANTY, CONTRACT, TORT (INCLUDING NEGLIGENCE), STATUTE, OR ANY OTHER LEGAL THEORY, EVEN IF WE HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES."
              }
            ]
          },
          { "type": "subtitle", "content": "Indemnification" },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "You agree to defend, indemnify, and hold harmless Meryll Dindin and his affiliates, licensors, and service providers from and against any claims, liabilities, damages, judgments, awards, losses, costs, expenses, or fees (including reasonable attorneys' fees) arising out of or relating to your violation of these Terms or your use of the Site, including but not limited to any use of the Site's content other than as expressly authorized in these Terms."
              }
            ]
          },
          { "type": "subtitle", "content": "Governing Law" },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "These Terms and any dispute or claim arising out of or related to them, their subject matter, or their formation shall be governed by and construed in accordance with the laws of the State of Nevada, without giving effect to any choice or conflict of law provision or rule."
              }
            ]
          },
          { "type": "subtitle", "content": "Dispute Resolution" },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "Any dispute, controversy, or claim arising out of or relating to these Terms or the Site shall first be attempted to be resolved through good-faith informal negotiation. If the dispute cannot be resolved informally within 30 days, either party may pursue resolution through binding arbitration administered in accordance with the rules of the American Arbitration Association, with the arbitration conducted in the State of Nevada. Each party shall bear its own costs of arbitration. Nothing in this section shall prevent either party from seeking injunctive or other equitable relief from a court of competent jurisdiction."
              }
            ]
          },
          { "type": "subtitle", "content": "Severability" },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "If any provision of these Terms is held by a court or other tribunal of competent jurisdiction to be invalid, illegal, or unenforceable for any reason, such provision shall be eliminated or limited to the minimum extent necessary such that the remaining provisions of these Terms will continue in full force and effect."
              }
            ]
          },
          { "type": "subtitle", "content": "Entire Agreement" },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "These Terms, together with our Privacy Policy, constitute the sole and entire agreement between you and Meryll Dindin regarding the Site and supersede all prior and contemporaneous understandings, agreements, representations, and warranties, both written and oral, regarding the Site."
              }
            ]
          },
          { "type": "subtitle", "content": "Contact" },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "If you have any questions or concerns about these Terms of Use, please contact us via "
              },
              {
                "type": "a",
                "content": "email",
                "props": {
                  "external": true,
                  "to": "mailto:merylldindin@icloud.com",
                  "rel": "noopener noreferrer",
                  "target": "_blank",
                  "underlined": true
                }
              },
              { "type": "p", "content": "." }
            ]
          }
        ]
      }
    }
  ]
}
