{
  "layout": "scrolled",
  "schema": {
    "type": "webPage",
    "prop": {
      "additionalType": "TermsOfService"
    }
  },
  "head": {
    "canonical": "/legal/terms-of-use/",
    "description": "Learn about the policies, user responsibilities, and terms of access that guide the use of Meryll Dindin's website. Familiarize yourself with our terms.",
    "thumbnail": "https://cdn.merylldindin.com/thumbnails/terms-of-use-20260202T111131.webp",
    "title": "Website Terms of Use | Meryll Dindin"
  },
  "components": [
    {
      "name": "LEGAL_SECTION",
      "id": "terms-of-use",
      "props": {
        "title": "Terms of Use",
        "date": "Last updated on March 8, 2025",
        "content": [
          { "type": "subtitle", "content": "Introduction" },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "These terms of use (''Terms'') govern your access to and use of this website, including any content, functionality, and services offered on or through "
              },
              {
                "type": "a",
                "content": "merylldindin.com",
                "props": { "to": "/", "underlined": true }
              },
              {
                "type": "p",
                "content": " (the ''Site''), whether as a guest or a registered user."
              }
            ]
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "Please read these Terms carefully before you start to use the Site. By using the Site, you accept and agree to be bound by these Terms and our Privacy Policy, found at "
              },
              {
                "type": "a",
                "content": "merylldindin.com/legal/privacy-policy",
                "props": { "to": "/legal/privacy-policy/", "underlined": true }
              },
              {
                "type": "p",
                "content": ", incorporated herein by reference. If you do not agree to these Terms or the Privacy Policy, you must not access or use the Site."
              }
            ]
          },
          { "type": "subtitle", "content": "Intellectual Property Rights" },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "The Site and its entire contents, features, and functionality (including but not limited to all information, software, text, displays, images, video, and audio) are owned by the Site owner or its licensors and are protected by United States and international copyright, trademark, patent, trade secret, and other intellectual property or proprietary rights laws."
              }
            ]
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "These Terms permit you to use the Site for your personal, non-commercial use only. You must not reproduce, distribute, modify, create derivative works of, publicly display, publicly perform, republish, download, store, or transmit any material from our Site except as permitted by these Terms."
              }
            ]
          },
          { "type": "subtitle", "content": "User Content" },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "The Site may allow you to submit, upload, publish, or otherwise make available content, including but not limited to text, photographs, videos, and audio (''User Content''). You retain all rights in, and are solely responsible for, the User Content you make available through the Site."
              }
            ]
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "By making any User Content available through the Site, you grant to the Site owner a non-exclusive, transferable, sub-licensable, royalty-free, worldwide license to use, copy, modify, create derivative works based on, distribute, publicly display, publicly perform, and otherwise exploit in any manner such User Content in all formats and distribution channels now known or hereafter devised, without further notice to or consent from you, and without the requirement of payment to you or any other person or entity."
              }
            ]
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "You represent and warrant that: (i) you own or have the necessary rights to share the User Content and to grant the rights and licenses contained in these Terms; (ii) the User Content does not violate or infringe upon the rights of any third party, including intellectual property rights, privacy rights, or rights of publicity; and (iii) the User Content complies with these Terms and all applicable laws and regulations."
              }
            ]
          },
          { "type": "subtitle", "content": "Prohibited Uses" },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "You agree not to use the Site: (i) in any way that violates any applicable law or regulation; (ii) to transmit any advertising or promotional material without prior permission; (iii) to impersonate or attempt to impersonate the Site owner or any other person or entity; (iv) to engage in any activity that interferes with or disrupts the Site; (v) to attempt to gain unauthorized access to any part of the Site; (vi) to conduct any automated use of the system; (vii) to introduce viruses, trojan horses, worms, or other harmful code; or (viii) to collect or harvest any personally identifiable information from the Site."
              }
            ]
          },
          { "type": "subtitle", "content": "Changes to the Terms" },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "We reserve the right to modify these Terms at any time in our sole discretion. All changes are effective immediately when posted and apply to all access to and use of the Site thereafter. Your continued use of the Site following the posting of revised Terms means that you accept and agree to the changes. You are expected to check this page periodically so you are aware of any changes."
              }
            ]
          },
          { "type": "subtitle", "content": "Termination" },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "We may terminate or suspend your access to all or part of the Site, without notice, for any conduct that we, in our sole discretion, believe violates these Terms or is harmful to other users of the Site, us, or third parties, or for any other reason."
              }
            ]
          },
          { "type": "subtitle", "content": "Disclaimer of Warranties" },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "THE SITE IS PROVIDED ON AN ''AS IS'' AND ''AS AVAILABLE'' BASIS, WITHOUT ANY WARRANTIES OF ANY KIND, EITHER EXPRESS OR IMPLIED. NEITHER THE SITE OWNER NOR ANY PERSON ASSOCIATED WITH THE SITE MAKES ANY WARRANTY OR REPRESENTATION WITH RESPECT TO THE COMPLETENESS, SECURITY, RELIABILITY, QUALITY, ACCURACY, OR AVAILABILITY OF THE SITE."
              }
            ]
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "THE FOREGOING DOES NOT AFFECT ANY WARRANTIES THAT CANNOT BE EXCLUDED OR LIMITED UNDER APPLICABLE LAW."
              }
            ]
          },
          { "type": "subtitle", "content": "Limitation of Liability" },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "IN NO EVENT WILL THE SITE OWNER, ITS AFFILIATES, OR THEIR LICENSORS, SERVICE PROVIDERS, EMPLOYEES, AGENTS, OFFICERS, OR DIRECTORS BE LIABLE FOR DAMAGES OF ANY KIND, UNDER ANY LEGAL THEORY, ARISING OUT OF OR IN CONNECTION WITH YOUR USE OF, OR INABILITY TO USE, THE SITE, ANY WEBSITES LINKED TO IT, ANY CONTENT ON THE SITE OR SUCH OTHER WEBSITES, INCLUDING ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL, CONSEQUENTIAL, OR PUNITIVE DAMAGES."
              }
            ]
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "THE FOREGOING DOES NOT AFFECT ANY LIABILITY THAT CANNOT BE EXCLUDED OR LIMITED UNDER APPLICABLE LAW."
              }
            ]
          },
          { "type": "subtitle", "content": "Indemnification" },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "You agree to defend, indemnify, and hold harmless the Site owner, its affiliates, licensors, and service providers, and its and their respective officers, directors, employees, contractors, agents, licensors, suppliers, successors, and assigns from and against any claims, liabilities, damages, judgments, awards, losses, costs, expenses, or fees (including reasonable attorneys' fees) arising out of or relating to your violation of these Terms or your use of the Site."
              }
            ]
          },
          { "type": "subtitle", "content": "Governing Law and Jurisdiction" },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "These Terms and any dispute or claim arising out of or related to them shall be governed by and construed in accordance with the laws of the State of Washington, without giving effect to any choice or conflict of law provision or rule."
              }
            ]
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "Any legal suit, action, or proceeding arising out of, or related to, these Terms or the Site shall be instituted exclusively in the federal courts of the United States or the courts of the State of Washington."
              }
            ]
          },
          { "type": "subtitle", "content": "Waiver and Severability" },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "No waiver by the Site owner of any term or condition set out in these Terms shall be deemed a further or continuing waiver of such term or condition or a waiver of any other term or condition, and any failure to assert a right or provision under these Terms shall not constitute a waiver of such right or provision."
              }
            ]
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "If any provision of these Terms is held by a court or other tribunal of competent jurisdiction to be invalid, illegal, or unenforceable for any reason, such provision shall be eliminated or limited to the minimum extent such that the remaining provisions of the Terms will continue in full force and effect."
              }
            ]
          },
          { "type": "subtitle", "content": "Entire Agreement" },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "The Terms, our Privacy Policy, and any terms and conditions incorporated herein constitute the sole and entire agreement between you and the Site owner regarding the Site and supersede all prior and contemporaneous understandings, agreements, representations, and warranties, both written and oral, regarding the Site."
              }
            ]
          },
          { "type": "subtitle", "content": "Contact Information" },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "If you have any questions or concerns about these Terms of Use, please contact us via "
              },
              {
                "type": "a",
                "content": "email",
                "props": {
                  "external": true,
                  "to": "mailto:merylldindin@icloud.com",
                  "rel": "noopener noreferrer",
                  "target": "_blank",
                  "underlined": true
                }
              },
              { "type": "p", "content": "." }
            ]
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "p",
                "content": "These Terms of Use are effective as of March 8, 2025, and will remain in effect except with respect to any changes in its provisions in the future, which will be in effect immediately after being posted on this page."
              }
            ]
          }
        ]
      }
    }
  ]
}
