{
  "layout": "scrolled",
  "schema": {
    "type": "blogPosting",
    "prop": {
      "dateModified": "2023-06-13",
      "datePublished": "2023-06-13",
      "keywords": "ai and heart health, fujistu ai laboratories, arrhythmia detection, topological data analysis, deep learning"
    }
  },
  "head": {
    "canonical": "/ventures/fujitsu/",
    "description": "My pioneering work with Fujitsu on AI for heart health. Advanced technologies transforming medical diagnostics and patient care.",
    "ogType": "article",
    "thumbnail": "https://cdn.merylldindin.com/thumbnails/fujitsu-20260202T110755.webp",
    "thumbnailAlt": "AI-generated heart with data analysis patterns",
    "title": "Fujitsu: AI for Heart Health | Meryll Dindin"
  },
  "components": [
    {
      "name": "ARTICLE_SECTION",
      "id": "home-section",
      "props": {
        "background": {
          "altText": "Abstract visualization of AI-driven cardiac diagnostics",
          "source": "https://cdn.merylldindin.com/assets/fujitsu-header-20260207T191209.webp",
          "lazySource": "https://cdn.merylldindin.com/assets/fujitsu-header-20260207T191209-lazy.webp",
          "mobile": "https://cdn.merylldindin.com/assets/fujitsu-header-20260207T191209-mobile.webp",
          "lazyMobile": "https://cdn.merylldindin.com/assets/fujitsu-header-20260207T191209-mobile-lazy.webp"
        },
        "content": [
          {
            "type": "headline",
            "prop": {
              "level": 1,
              "text": "Cracking the Code: My Uncharted Venture into AI and Heart Health",
              "typography": "text-cartesian headline-2"
            }
          },
          {
            "type": "headline",
            "prop": {
              "level": 2,
              "text": "Last Edited on June 13, 2023",
              "typography": "text-lexend-deca headline-6"
            }
          },
          {
            "type": "text",
            "prop": "A heart, they say, beats to its own rhythm. It's an individual's lifeline, a ticking timepiece choreographed by nature. In 2018, my life took an unexpected turn, and my own rhythm led me to Japan, a captivating place known for its intricate blend of tradition and technology. Armed with my previous experience of working on a project for Parkinson's disease management, I was ready to dive deeper into the pulsating world of AI and healthcare."
          },
          {
            "type": "text",
            "prop": "I was about to tackle the silent and often undetected malady - arrhythmia. This condition, which brings an irregular heartbeat, often foreshadows severe heart disease. Tasked with finding a way to detect such irregularities, I was introduced to a challenge that piqued my intellectual curiosity. I knew I had my work cut out for me, but a part of me was excited to navigate these uncharted waters."
          },
          {
            "type": "text",
            "prop": "Japan was different, an experience that I can only liken to the feeling you get when you open a book you’ve never read before. It's the first line that hooks you, and before you know it, you're engrossed, living the characters' lives. And just like that, I found myself living my new life, absorbed in a culture rich in tradition, and working at the cutting-edge of AI at Fujitsu AI Laboratories."
          },
          {
            "type": "text",
            "prop": "The project felt a bit like a solitary journey, and in this isolation, I found a certain kind of quiet determination. I was working on the deep end of deep learning, navigating through an intricate web of algorithms, pushing the boundaries of what was possible. The task was clear: develop a technology capable of not only identifying arrhythmia but doing so in a way that was beyond the capabilities of Electrocardiography (ECG)."
          },
          {
            "type": "image",
            "prop": {
              "altText": "Slide from CAIAC conference picturing topology importance",
              "source": "https://cdn.merylldindin.com/assets/fujitsu-topology.webp",
              "lazySource": "https://cdn.merylldindin.com/assets/fujitsu-topology-lazy.webp"
            }
          },
          {
            "type": "text",
            "prop": "Our not-so-secret weapon was Topological Data Analysis (TDA), a robust waveform analysis technology. TDA had the unique capability to create AI models that could detect anomalies in time-series data. Its resilience to data deformations was exactly what we needed for our ambitious endeavor. With TDA, we were able to fine-tune our technology to detect arrhythmia with a high level of accuracy, even in patients previously unseen by the system."
          },
          {
            "type": "text",
            "prop": "In due course, the results of our labor began to bear fruit. We were granted a patent for our technology, a validation that served as a testament to our innovative approach. Moreover, our scholarly paper detailing our work was selected for presentation at the Canadian Conference on Artificial Intelligence in 2020, an honor that I cherish. Later, the paper found a place in the prestigious 'Springer Nature'."
          },
          {
            "type": "image",
            "prop": {
              "altText": "Top of our submitted paper",
              "source": "https://cdn.merylldindin.com/assets/fujitsu-paper.webp",
              "lazySource": "https://cdn.merylldindin.com/assets/fujitsu-paper-lazy.webp"
            }
          },
          {
            "type": "text",
            "prop": "By October 2021, the technology that was born out of a solitary journey and persistent exploration was being put to the test in a clinical trial with The University of Tokyo Hospital. It was no longer just lines of code and algorithms; it was being used to possibly save lives, to make a tangible difference. This was not just a breakthrough for us, but it also brought new hope for the early detection of heart diseases."
          },
          {
            "type": "text",
            "prop": "The technology continues to be used in Tokyo clinics, contributing to the fight against the global issue of heart disease. From the heart of Tokyo to the very core of AI in healthcare, my journey has been nothing short of extraordinary. Through it all, I've learned that when you're at the intersection of healthcare and AI, the potential for impact is not just huge, it's heartwarming."
          },
          {
            "type": "image",
            "prop": {
              "altText": "List of places Meryll has been travelling to in Japan",
              "source": "https://cdn.merylldindin.com/assets/fujitsu-travel.webp",
              "lazySource": "https://cdn.merylldindin.com/assets/fujitsu-travel-lazy.webp"
            }
          },
          {
            "type": "text",
            "prop": "Life in Japan, my time at Fujitsu, the work we did - it all syncs together like a harmonious symphony, much like a healthy heartbeat. Reflecting on it, I can confidently say that while this journey came with its own unique challenges, it also came with an equal, if not greater, amount of satisfaction. As the story continues to unfold, I look forward to sharing more chapters with you. The heart of this tale beats on, rhythm by rhythm, line by line, one innovation at a time."
          },
          {
            "type": "image",
            "prop": {
              "altText": "Fujitsu website screenshot",
              "source": "https://cdn.merylldindin.com/assets/fujitsu-header.webp",
              "lazySource": "https://cdn.merylldindin.com/assets/fujitsu-header-lazy.webp"
            }
          },
          {
            "type": "headline",
            "prop": {
              "level": 2,
              "text": "References",
              "typography": "headline-3 my-6"
            }
          },
          {
            "type": "headline",
            "prop": {
              "level": 3,
              "text": "Science Contributions",
              "typography": "text-lexend-deca headline-6 my-6"
            }
          },
          {
            "type": "article",
            "prop": {
              "href": "https://link.springer.com/chapter/10.1007/978-3-030-47358-7_17",
              "title": "Topological Data Analysis for Arrhythmia Detection Through Modular Neural Networks",
              "description": "Innovative deep learning approach for monitoring heart conditions and detecting arrhythmia from ECG signals."
            }
          },
          {
            "type": "article",
            "prop": {
              "href": "https://patents.google.com/patent/US20200074281A1/",
              "title": "Computer-readable recording medium, abnormality determination method, and abnormality determination device",
              "description": "A unique device that uses an autoencoder and machine learning to determine abnormal waveform data from an object's movement."
            }
          },
          {
            "type": "article",
            "prop": {
              "href": "https://arxiv.org/pdf/1906.05795",
              "title": "Topological Data Analysis for Arrhythmia Detection Through Modular Neural Networks",
              "description": "Research paper presenting a novel approach combining topological data analysis with modular neural networks for arrhythmia classification from ECG signals."
            }
          },
          {
            "type": "article",
            "prop": {
              "href": "https://cdn.merylldindin.com/documents/conference-caiac.pdf",
              "title": "Topological Data Analysis for Arrhythmia Detection Through Modular Neural Networks",
              "description": "Presentation slides showcasing AI and heart health research, focusing on arrhythmia detection using topological data analysis."
            }
          },
          {
            "type": "headline",
            "prop": {
              "level": 3,
              "text": "Press Releases",
              "typography": "text-lexend-deca headline-6 my-6"
            }
          },
          {
            "type": "article",
            "prop": {
              "href": "https://www.mobihealthnews.com/news/asia/over-630000-ecg-data-used-develop-ai-tool-early-diagnosis-heart-disease-japan#:~:text=waveform%20analysis%20technology%20called%20topological%20data%20analysis",
              "title": "AI Tool for Heart Disease Diagnosis in Japan",
              "description": "Clinical research commences to verify an AI technology's effectiveness in estimating abnormal heart movements."
            }
          },
          {
            "type": "article",
            "prop": {
              "href": "https://japan.zdnet.com/article/35174199/",
              "title": "AI Tech Identifying Abnormal Conditions | ZDNET Japan",
              "description": "Fujitsu and Inria develop first AI technology to identify determining factors of abnormal conditions in time series data."
            }
          },
          {
            "type": "article",
            "prop": {
              "href": "https://syncedreview.com/2020/03/31/new-fujitsu-inria-tech-automatically-builds-anomaly-detecting-ai-models/",
              "title": "Anomaly-Detecting AI Models by Fujitsu & Inria",
              "description": "Collaboration develops technology to automatically create AI models for anomaly detection by extracting information from time-series data."
            }
          },
          {
            "type": "article",
            "prop": {
              "href": "https://japantoday.com/category/features/health/fujitsu-university-of-tokyo-hospital-to-research-ai-in-fight-against-heart-disease",
              "title": "Fujitsu & Tokyo Hospital: AI for Heart Disease",
              "description": "Joint research to verify AI's effectiveness in estimating abnormal heart movements based on ECG data."
            }
          },
          {
            "type": "article",
            "prop": {
              "href": "https://www.fujitsu.com/global/about/research/business/artificial-intelligence/",
              "title": "Trusted AI: Creating New Value",
              "description": "Trusted AI – Collaborating with humans to create new value."
            }
          },
          {
            "type": "article",
            "prop": {
              "href": "https://www.inria.fr/en/fujitsu-and-inria-jointly-develop-technology-automatically-create-anomaly-detecting-ai-models",
              "title": "Anomaly-Detecting AI Tech by Fujitsu & Inria",
              "description": "Technology reduces man hours needed for creating AI models leveraging Topological Data Analysis (TDA), accelerating deployment."
            }
          },
          {
            "type": "article",
            "prop": {
              "href": "https://www.inria.fr/en/joint-research-fujitsu-and-inria-advances-early-detection-heart-disease",
              "title": "Fujitsu & Inria: Early Detection of Heart Disease",
              "description": "AI technology developed by Fujitsu and Inria's DataShape team undergoes clinical trial for early detection of heart disease."
            }
          }
        ]
      }
    }
  ]
}
