{
  "layout": "scrolled",
  "schema": {
    "type": "blogPosting",
    "prop": {
      "dateModified": "2026-02-07",
      "datePublished": "2026-02-07",
      "keywords": "parallel learning, special education, K-12, teletherapy, edtech, healthtech, digital health, scale-up, AI"
    }
  },
  "head": {
    "canonical": "/ventures/parallel-learning/",
    "description": "From data engineer to VP of Product and Engineering, my journey scaling Parallel Learning's technology to transform K-12 special education across the United States.",
    "ogType": "article",
    "thumbnail": "https://cdn.merylldindin.com/thumbnails/parallel-learning.webp",
    "thumbnailAlt": "AI-generated educational technology and learning paths",
    "title": "Parallel: Scaling K-12 Teletherapy | Meryll Dindin"
  },
  "components": [
    {
      "name": "ARTICLE_SECTION",
      "id": "home-section",
      "props": {
        "background": {
          "altText": "Abstract visualization of scalable K-12 teletherapy and digital education",
          "source": "https://cdn.merylldindin.com/assets/parallel-header-20260207T194637.webp",
          "lazySource": "https://cdn.merylldindin.com/assets/parallel-header-20260207T194637-lazy.webp",
          "mobile": "https://cdn.merylldindin.com/assets/parallel-header-20260207T194637-mobile.webp",
          "lazyMobile": "https://cdn.merylldindin.com/assets/parallel-header-20260207T194637-mobile-lazy.webp"
        },
        "content": [
          {
            "type": "headline",
            "prop": {
              "level": 1,
              "text": "From Startup to Scale-Up: Building the Technology Engine at Parallel",
              "typography": "text-cartesian headline-2"
            }
          },
          {
            "type": "headline",
            "prop": {
              "level": 2,
              "text": "Last Edited on February 07, 2026",
              "typography": "text-lexend-deca headline-6"
            }
          },
          {
            "type": "text",
            "prop": "In July 2023, I joined Parallel Learning through what might be one of the most meaningful transitions of my career. At Polygon, the company I co-founded to provide remote evaluations for learning differences, we had been pivoting from raising our Series A to an acquisition process with Parallel. The alignment was immediate and profound: Parallel was tackling the same mission of transforming special education, but at a fundamentally different scale, connecting K-12 school districts with licensed providers through a comprehensive teletherapy platform. Having just closed their Series A, they were poised to build the technology infrastructure that would carry them forward. I saw the chance to continue the work I cared about most, with the resources and reach to truly change the landscape."
          },
          {
            "type": "text",
            "prop": "Parallel Learning is the leading K-12 teletherapy platform in the United States, partnering with school districts to deliver assessments, speech therapy, occupational therapy, and specialized instruction to students with learning differences. Parallel operates at the institutional level, working with school districts across 25+ states and serving thousands of students who might otherwise go without the support they need. The mission resonated deeply: ensuring that every student who thinks differently gets access to the services they deserve."
          },
          {
            "type": "text",
            "prop": "My first instinct upon arriving was the same one I have had at every venture I have been part of: map everything before building anything. Within 48 hours, I had created a comprehensive presentation documenting every service and tool in Parallel's ecosystem. I explored the data warehouse, the reporting dashboards, and started untangling the data architecture. When offered a starter project, I pushed back. I believed there would be more value in completing a full overview of our data infrastructure before writing a single line of code. That cartographer instinct would define my entire tenure."
          },
          {
            "type": "text",
            "prop": "The first deliverables came fast. By August 2023, I had shipped the first version of the Capacity Dashboard, a tool that would eventually evolve into the supply-demand system powering staffing decisions across the company. Simultaneously, I built the Provider Pay system, unifying data from half a dozen disconnected platforms into a single architecture that had never existed before. What started as spreadsheets with daily refresh schedules graduated into automated payroll summaries, quality assurance dashboards, and systematic edge case resolution. By year's end, I had cleared all legacy technical debt and reduced the data processing pipeline from nearly seven minutes to just over one minute per iteration."
          },
          {
            "type": "text",
            "prop": "The scope expanded organically. My weekly updates to the leadership team shifted from data-focused briefings to engineering-wide updates, a subtle but telling evolution. I was defining marketing metrics, building clinical outcomes dashboards, performing security reviews, negotiating vendor contracts, and managing compliance integrations. I was no longer just building data pipelines; I was architecting the entire technology function. The transition from Director of Data and AI to Director of Engineering was less a promotion and more an acknowledgment of what had already been happening."
          },
          {
            "type": "text",
            "prop": "In April 2024, a milestone that I am particularly proud of: our new proprietary platform to manage student data, session calendars, provider workflows, and facilitator operations was officially named Pathway. This was the product I had been building from the ground up, a platform that would replace the patchwork of third-party tools and give Parallel true ownership of its technology stack. Through the second half of 2024, the platform matured rapidly as we built out administrator functions, added new provider types, and developed automation for onboarding schools at scale. Today, Pathway is the backbone of everything Parallel does."
          },
          {
            "type": "text",
            "prop": "Scaling technology means scaling people. When I joined, I was the only dedicated data hire, joining a small team of engineers, an engineering manager, and a few contractors. I drafted the first hiring plan and began building the team methodically. Over the next two years, I grew the team from a solo operation to a cross-functional group of eight, covering data engineering, product management, software engineering, and applied AI. I designed the interview process, introduced structured onboarding, and pioneered a performance management approach centered on transparency: monthly one-on-ones with shared notes and summaries that helped me track goals, trends, and growth across every team member."
          },
          {
            "type": "text",
            "prop": "Security and compliance became a personal mission. I managed the full transition from our previous security certification to the latest ISO 27001:2022 standard, coordinating with external auditors and overseeing penetration testing, vendor compliance reviews, and automated device monitoring. I also authored our FERPA compliance documentation from scratch. In April 2025, we successfully passed our ISO 27001:2022 audit, a moment that reinforced the quality of our security posture and gave school districts the confidence to trust us with their most sensitive student data."
          },
          {
            "type": "image",
            "prop": {
              "altText": "Meryll Dindin receiving the Innovator award at the Parallel Learning company retreat",
              "source": "https://cdn.merylldindin.com/assets/parallel-innovator-award.webp",
              "lazySource": "https://cdn.merylldindin.com/assets/parallel-innovator-award-lazy.webp"
            }
          },
          {
            "type": "text",
            "prop": "By mid-2025, the title caught up with the role. As VP of Product and Engineering, my responsibilities formally encompassed what I had been doing for over a year: setting the technical and product vision for the organization, defining strategy aligned with business objectives, presenting to the board and investors, and overseeing the product roadmap and engineering execution across all products. At our company retreat, I received the \"Innovator\" award, determined by peer votes across the entire company. That recognition meant more to me than any title change. It validated not just the systems I had built, but the vision and direction I had set while executing on it day after day."
          },
          {
            "type": "text",
            "prop": "The AI strategy became a defining thread of the next chapter. I launched multiple initiatives: intelligent agents for automating time-intensive clinical and administrative workflows, a standalone generative AI platform, and an AI-powered support system running in production within Pathway. I positioned Parallel as AI-native digital health for K-12, building practical AI workflows for clinical documentation, scheduling, and quality assurance rather than chasing the generic edtech label. I became the company's AI advocate, teaching teams to leverage AI for meeting notes, data analysis, and content creation, and constantly pushing the boundaries of what a lean technology team could accomplish with the right tools."
          },
          {
            "type": "image",
            "prop": {
              "altText": "Meryll Dindin receiving the Digital Health Hub Rising Star award on behalf of Parallel Learning at HLTH Vegas",
              "source": "https://cdn.merylldindin.com/assets/parallel-hlth-digital-hub-prize.webp",
              "lazySource": "https://cdn.merylldindin.com/assets/parallel-hlth-digital-hub-prize-lazy.webp"
            }
          },
          {
            "type": "text",
            "prop": "The company's trajectory has been validated by a remarkable series of external recognitions. Parallel was named to Will Reed's Top 100 Class of 2023, spotlighting early-stage venture-backed startups shaping workplace culture from a pool of over 2,500 companies. In 2024, Business Insider included us in their \"44 Startups to Bet Your Career On\" list. Fast Company named us one of their 2025 Most Innovative Companies in education, citing the platform's expansion of access to special education and the launch of Pathway. The World Economic Forum selected Parallel as a 2025 Technology Pioneer, a cohort of 100 companies from 28 countries recognized for using breakthrough technologies to positively shape the future. And in December 2025, Forbes ran an exclusive feature on our $20 million Series B and our student outcomes research."
          },
          {
            "type": "text",
            "prop": "Most recently, Parallel was named to the 2026 New York Digital Health 100. This recognition is more than a badge. It is outside validation that special education and school-based mental health now belong in the core healthcare innovation conversation, and that a fully virtual, clinically rigorous model can deliver outcomes at scale, not just coverage. During the 2024-2025 school year, Parallel delivered more than 77,000 sessions across 18 states. Eighty percent of the communities we served were rated High or Very High on the CDC Social Vulnerability Index. In those districts, 98% of students supported through Parallel were at or above target expectations for their IEP goals by year's end. Reach and outcomes together are the point."
          },
          {
            "type": "text",
            "prop": "Representing Parallel at industry conferences gave me a front-row seat to the broader digital health and education technology landscape. At HLTH 2025 in Las Vegas, I received the Digital Health Hub Rising Star award on behalf of Parallel in the Mental and Behavioral Health category, presented on the main conference stage. At Google Next '25, I explored the frontier of cloud and AI infrastructure that powers platforms like ours. And at NCASE 2025, I witnessed firsthand how Parallel's approach to working with school districts resonates with the practitioners and administrators who live this work every day. Each conference reinforced the same conviction: the intersection of clinical expertise and technology is where the most meaningful impact happens."
          },
          {
            "type": "image",
            "prop": {
              "altText": "Meryll Dindin networking at the NCASE 2025 conference representing Parallel Learning",
              "source": "https://cdn.merylldindin.com/assets/parallel-ncase-conference.webp",
              "lazySource": "https://cdn.merylldindin.com/assets/parallel-ncase-conference-lazy.webp"
            }
          },
          {
            "type": "text",
            "prop": "With the Series B closed in late 2025, Parallel entered a fundamentally different chapter. This is no longer a startup finding product-market fit. It is a scale-up, a distinction I do not take lightly. The infrastructure I built as a solo data engineer in 2023 now powers a compliance dashboard serving providers and clinical managers in real time, a pay dashboard with regression monitoring, a full HR system integration, and a sales intelligence platform. The team I hired now ships independently. The platform we named Pathway now serves thousands of students. The AI strategy I defined is becoming operational reality."
          },
          {
            "type": "text",
            "prop": "Looking back on two and a half years at Parallel, the throughline is clear. In my first week, I created a presentation mapping every service in the ecosystem. Today, I am still doing the same thing, but for district compliance systems, AI architectures, and pay pipeline monitoring. The instinct to understand before building, to map before coding, to audit before architecting, that never changed. What changed was the scale. And perhaps that is the most honest summary of this journey: the same curiosity and persistence, applied to an ever-expanding canvas, in service of the mission that brought me here in the first place. Ensuring that every student who thinks differently gets the support they deserve."
          },
          {
            "type": "image",
            "prop": {
              "altText": "Parallel Learning website screenshot",
              "source": "https://cdn.merylldindin.com/assets/parallel-header.webp",
              "lazySource": "https://cdn.merylldindin.com/assets/parallel-header-lazy.webp"
            }
          },
          {
            "type": "headline",
            "prop": {
              "level": 2,
              "text": "References",
              "typography": "headline-3 my-6"
            }
          },
          {
            "type": "headline",
            "prop": {
              "level": 3,
              "text": "Social Networks",
              "typography": "text-lexend-deca headline-6"
            }
          },
          {
            "type": "socials",
            "prop": [
              {
                "ariaLabel": "Website of Parallel Learning",
                "icon": "WEB",
                "rel": "nofollow noopener external",
                "target": "_blank",
                "to": "https://www.parallellearning.com/"
              },
              {
                "ariaLabel": "Facebook page of Parallel Learning",
                "icon": "FACEBOOK",
                "rel": "nofollow noopener noreferrer external",
                "target": "_blank",
                "to": "https://www.facebook.com/JoinParallel/"
              },
              {
                "ariaLabel": "X page of Parallel Learning",
                "icon": "TWITTER",
                "rel": "nofollow noopener noreferrer external",
                "target": "_blank",
                "to": "https://x.com/joinparallel_us/"
              },
              {
                "ariaLabel": "Instagram page of Parallel Learning",
                "icon": "INSTAGRAM",
                "rel": "nofollow noopener noreferrer external",
                "target": "_blank",
                "to": "https://www.instagram.com/joinparallel/"
              },
              {
                "ariaLabel": "LinkedIn page of Parallel Learning",
                "icon": "LINKEDIN",
                "rel": "nofollow noopener noreferrer external",
                "target": "_blank",
                "to": "https://www.linkedin.com/company/join-parallel/"
              },
              {
                "ariaLabel": "YouTube channel of Parallel Learning",
                "icon": "YOUTUBE",
                "rel": "nofollow noopener noreferrer external",
                "target": "_blank",
                "to": "https://www.youtube.com/@joinparallel_us/"
              }
            ]
          },
          {
            "type": "headline",
            "prop": {
              "level": 3,
              "text": "Awards and Recognition",
              "typography": "text-lexend-deca headline-6 my-6"
            }
          },
          {
            "type": "article",
            "prop": {
              "description": "Business Insider names Parallel Learning to its 44 Startups to Bet Your Career On list, highlighting the company as a one-stop-shop for schools to support children with learning differences.",
              "href": "https://www.businessinsider.com/startups-to-bet-your-career-on-in-2024-2024-2",
              "title": "44 Startups to Bet Your Career On in 2024 | Business Insider"
            }
          },
          {
            "type": "article",
            "prop": {
              "description": "Fast Company recognizes Parallel Learning among its 2025 Most Innovative Companies in education for expanding access to special education and launching Pathway.",
              "href": "https://www.fastcompany.com/91269358/education-most-innovative-companies-2025",
              "title": "Most Innovative Companies in Education 2025 | Fast Company"
            }
          },
          {
            "type": "article",
            "prop": {
              "description": "Parallel Learning selected as a 2025 Technology Pioneer by the World Economic Forum, joining a cohort of 100 companies from 28 countries recognized for breakthrough technologies.",
              "href": "https://www.weforum.org/stories/2025/06/2025-technology-pioneers/",
              "title": "2025 Technology Pioneers | World Economic Forum"
            }
          },
          {
            "type": "article",
            "prop": {
              "description": "Parallel Learning honored as a Rising Star in Mental and Behavioral Health at the 2025 Digital Health Hub Foundation Awards at HLTH Las Vegas.",
              "href": "https://www.digitalhealthhub.org/awards/2025/winners",
              "title": "Rising Star in Mental & Behavioral Health | HLTH Digital Health Awards"
            }
          },
          {
            "type": "article",
            "prop": {
              "description": "Parallel Learning named to the 2026 New York Digital Health 100, recognizing the most innovative and high-impact digital health startups in the New York region.",
              "href": "https://www.dhny.co/dh100",
              "title": "Digital Health 100 2026 | Digital Health New York"
            }
          },
          {
            "type": "headline",
            "prop": {
              "level": 3,
              "text": "Press Releases",
              "typography": "text-lexend-deca headline-6 my-6"
            }
          },
          {
            "type": "article",
            "prop": {
              "description": "Forbes explores how Parallel Learning empowers students with disabilities through technology and expanded access to remote special education services.",
              "href": "https://www.forbes.com/sites/jenniferpalumbo/2022/02/03/parallel-learning-expands-to-empower-students-with-disabilities/",
              "title": "Parallel Learning Expands to Empower Students | Forbes"
            }
          },
          {
            "type": "article",
            "prop": {
              "description": "Business Insider details the pitch deck Parallel Learning used to raise funding from Tiger Global and other investors for its K-12 teletherapy platform.",
              "href": "https://www.businessinsider.com/pitch-deck-startup-parallel-health-kids-tiger-dyslexia-global-2022-5",
              "title": "Parallel Learning's Pitch Deck | Business Insider"
            }
          },
          {
            "type": "article",
            "prop": {
              "description": "TechCrunch covers Parallel Learning's $20M funding round to expand remote special education assessment and tutoring services across the United States.",
              "href": "https://techcrunch.com/2022/05/24/parallel-learning-expands-remote-special-education-assessment-and-tutoring-with-20m-round/",
              "title": "Parallel Learning Raises $20M for Special Ed | TechCrunch"
            }
          },
          {
            "type": "article",
            "prop": {
              "description": "Ed Week Market Brief reports on Parallel Learning's $20M Series A raise alongside broader K-12 dealmaking activity in the education technology sector.",
              "href": "https://marketbrief.edweek.org/strategy-operations/k-12-dealmaking-riverside-insights-acquires-sel-organization-parallel-learning-raises-20m-series-a/2022/06",
              "title": "Parallel Learning Raises $20M Series A | Ed Week Market Brief"
            }
          },
          {
            "type": "article",
            "prop": {
              "description": "Forbes examines how education startup Parallel Learning uses technology to empower every student who thinks different through accessible evaluations and support.",
              "href": "https://www.forbes.com/sites/stevenaquino/2022/10/14/how-education-startup-parallel-learning-uses-tech-to-empower-every-student-who-thinks-different/",
              "title": "How Parallel Learning Empowers Every Student | Forbes"
            }
          },
          {
            "type": "article",
            "prop": {
              "description": "Healthtech founders including Parallel Learning's team share pitch deck advice and insights for investors seeking funding in the digital health space.",
              "href": "https://www.businessinsider.com/healthtech-founders-share-pitch-deck-advice-investors-funding-2022-12",
              "title": "Healthtech Founders Share Pitch Deck Advice | Business Insider"
            }
          },
          {
            "type": "article",
            "prop": {
              "description": "PR Web announces Parallel Learning's new funding round and five key leadership hires to further scale and expand K-12 teletherapy services.",
              "href": "https://www.prweb.com/releases/leading-k-12-teletherapy-platform-parallel-secures-new-round-of-funding--adds-five-key-hires-to-leadership-team-to-further-scale-and-expand-services-302029120.html",
              "title": "Parallel Secures New Funding & Adds Key Hires | PR Web"
            }
          },
          {
            "type": "article",
            "prop": {
              "description": "TechCrunch reports on Parallel Learning securing new funding for its teletherapy platform serving kids with special needs across U.S. school districts.",
              "href": "https://techcrunch.com/2024/01/09/parallel-gets-new-funding-for-its-teletherapy-platform-for-kids-with-special-needs/",
              "title": "Parallel Gets New Funding for Teletherapy Platform | TechCrunch"
            }
          },
          {
            "type": "article",
            "prop": {
              "description": "Forbes exclusively covers Parallel Learning's $20 million Series B led by Valspring Capital, revealing 98% of students met or exceeded IEP goals on the platform.",
              "href": "https://www.forbes.com/sites/cherylrobinson/2025/12/09/investors-back-parallels-20-million-series-b-to-transform-special-education/",
              "title": "Investors Back Parallel's $20M Series B | Forbes"
            }
          },
          {
            "type": "article",
            "prop": {
              "description": "MobiHealthNews covers Parallel Learning's $20M raise to expand pediatric behavioral health and learning support services nationwide.",
              "href": "https://www.mobihealthnews.com/news/parallel-learning-scores-20m-expand-pediatric-behavioral-health-learning-support-services",
              "title": "Parallel Learning Scores $20M to Expand Services | MobiHealthNews"
            }
          },
          {
            "type": "article",
            "prop": {
              "description": "Fox News features Parallel Learning's approach to supporting students with learning differences through technology-enabled special education services.",
              "href": "https://www.foxnews.com/video/6336547306112",
              "title": "Parallel Learning on Supporting Students | Fox News"
            }
          },
          {
            "type": "article",
            "prop": {
              "description": "Meryll Dindin's team profile on the Parallel Learning website, detailing his role as VP of Product and Engineering.",
              "href": "https://www.parallellearning.com/team-members/meryll-dindin",
              "title": "Meryll Dindin | Parallel Learning Team"
            }
          }
        ]
      }
    }
  ]
}
