{
  "layout": "scrolled",
  "schema": {
    "type": "blogPosting",
    "prop": {
      "dateModified": "2023-06-06",
      "datePublished": "2023-06-06",
      "keywords": "polygon, polygon technologies, polygon psychology group, learning differences, dyslexia, ADHD, startup"
    }
  },
  "head": {
    "canonical": "/ventures/polygon/",
    "description": "Polygon provides online support for individuals with dyslexia, ADHD, and other learning differences through personalized care.",
    "ogType": "article",
    "thumbnail": "https://cdn.merylldindin.com/thumbnails/polygon-20260202T110820.webp",
    "thumbnailAlt": "AI-generated brain with learning difference patterns",
    "title": "Polygon: Learning Differences Support | Meryll Dindin"
  },
  "components": [
    {
      "name": "ARTICLE_SECTION",
      "id": "home-section",
      "props": {
        "background": {
          "altText": "Abstract visualization of neurodiversity and learning differences",
          "source": "https://cdn.merylldindin.com/assets/polygon-header-20260207T191255.webp",
          "lazySource": "https://cdn.merylldindin.com/assets/polygon-header-20260207T191255-lazy.webp",
          "mobile": "https://cdn.merylldindin.com/assets/polygon-header-20260207T191255-mobile.webp",
          "lazyMobile": "https://cdn.merylldindin.com/assets/polygon-header-20260207T191255-mobile-lazy.webp"
        },
        "content": [
          {
            "type": "headline",
            "prop": {
              "level": 1,
              "text": "A Journey of Passion and Persistence: Co-Founding Polygon",
              "typography": "text-cartesian headline-2"
            }
          },
          {
            "type": "headline",
            "prop": {
              "level": 2,
              "text": "Last Edited on June 06, 2023",
              "typography": "text-lexend-deca headline-6"
            }
          },
          {
            "type": "text",
            "prop": "In the heart of Silicon Valley, amidst the bustling start-up scene, there was a gap that needed to be filled. A gap as wide as the learning differences that affect 1 in 5 people, representing 70 million individuals in the U.S. alone. That gap was the lack of accessible and effective remote evaluations and support for learning differences such as dyslexia and ADHD. This is the story of how we filled that gap, of how we founded Polygon."
          },
          {
            "type": "text",
            "prop": "My journey with Polygon began at UC Berkeley, where I pursued a master's degree in biomedical engineering. It was there that I met Jack Rolo, who was studying for his MBA. We shared a common passion for using technology to address challenges in healthcare, and when Jack approached me with the idea of Polygon, I knew I had to be a part of it."
          },
          {
            "type": "image",
            "prop": {
              "altText": "Jack, Meryll, Josh, founders of Polygon at Berkeley SkyDeck",
              "source": "https://cdn.merylldindin.com/assets/polygon-skydeck.webp",
              "lazySource": "https://cdn.merylldindin.com/assets/polygon-skydeck-lazy.webp"
            }
          },
          {
            "type": "text",
            "prop": "Jack was diagnosed with dyslexia at a late age, and his personal experience played a significant role in the inception of Polygon. He was building the company he wished he had access to as a child, and I felt a strong pull to help him bring that vision to life."
          },
          {
            "type": "text",
            "prop": "After initial discussions and brainstorming sessions, we began to build our proprietary assessment platform. We received $600k in pre-seed funding and later closed a $3.6 million investment led by Spark Capital, which brought our total funding to date to $4.2 million. This capital infusion was instrumental in helping us further develop our product and expand our geographical reach."
          },
          {
            "type": "image",
            "prop": {
              "altText": "Spark Capital and Pear VC, major investors of Polygon",
              "source": "https://cdn.merylldindin.com/assets/polygon-investors.webp",
              "lazySource": "https://cdn.merylldindin.com/assets/polygon-investors-lazy.webp"
            }
          },
          {
            "type": "text",
            "prop": "We were on a mission to make gold-standard learning differences services accessible to the mass market. And we were determined to do this by leveraging technology to create an efficient, accurate, and fair experience for both our clinicians and clients."
          },
          {
            "type": "text",
            "prop": "Our team of expert licensed psychologists, led by our Chief Clinical Officer, Dr. Sharon Witkin, was carefully selected through a rigorous 5-stage interview process. We equipped them with our proprietary remote assessment platform and a professional video-conferencing setup. We ensured they completed extensive training and strictly adhered to Polygon's clinical practices. Unlike online marketplaces that rely on hourly contract psychologists, we chose to make our clinicians full-time employees, offering them full benefits and equity compensation. This decision has been integral in ensuring the quality of service we provide."
          },
          {
            "type": "text",
            "prop": "By May 2022, we were ready to launch. And the response we received was overwhelming. Clients began to pour in, and we were humbled by their feedback. Yes, there were challenges and learning opportunities, as there are with any new venture, but the impact we were making was palpable."
          },
          {
            "type": "text",
            "prop": "Today, our comprehensive evaluations start at $1,995, which is 5x less than traditional alternatives, making it more accessible for individuals across the board. Our evaluations include targeted psychoeducational and comprehensive neuropsychological assessments, and we provide individualized recommendations to help inform eligibility for services and accommodations. We strive to deliver these reports within 2 weeks, and our clinicians are always available for follow-up meetings and discussions."
          },
          {
            "type": "text",
            "prop": "Our journey has just begun. With further platform development, additional services, and national expansion on the horizon, we're excited about the future. We're here to ensure that every individual with a learning difference reaches their full potential and thrives in a world that has traditionally been built for the 'average' person."
          },
          {
            "type": "text",
            "prop": "As I look back on our journey, I am filled with immense gratitude. Gratitude for the opportunity to apply my passion for technology to such an important cause, and gratitude for our clients, whose courage and determination inspire us every day."
          },
          {
            "type": "text",
            "prop": "From day one, we have been driven by our mission to rewrite the narrative around learning differences - to focus on differences, not disabilities. We see our clients not as circles conforming to an average mold, but as unique polygons, each with their distinct strengths and weaknesses."
          },
          {
            "type": "image",
            "prop": {
              "altText": "Jack, Meryll, Josh, holding the check from winning the competition Egal",
              "source": "https://cdn.merylldindin.com/assets/polygon-egal.webp",
              "lazySource": "https://cdn.merylldindin.com/assets/polygon-egal-lazy.webp"
            }
          },
          {
            "type": "text",
            "prop": "There have been challenges along the way, of course. Launching a start-up is never a smooth journey, and the terrain of remote learning differences services was relatively unexplored. We had to navigate the complexities of building a proprietary platform, ensure stringent quality control, and strike a balance between accessibility and sustainability. User reviews have been constructive, helping us understand where we stand and how we can improve. But with every hurdle we've encountered, we've emerged stronger, more determined, and more focused on our mission."
          },
          {
            "type": "text",
            "prop": "I am especially proud of our team. Each member brings their unique skills and experiences to the table, contributing to a whole that is greater than the sum of its parts. Our leadership team, in particular, has been instrumental in guiding Polygon's journey. Jack's vision and drive, Sharon's clinical expertise, and my passion for technology have combined to form a formidable force."
          },
          {
            "type": "image",
            "prop": {
              "altText": "Jack, Meryll, founders of Polygon at WeWork Santa Monica",
              "source": "https://cdn.merylldindin.com/assets/polygon-wework.webp",
              "lazySource": "https://cdn.merylldindin.com/assets/polygon-wework-lazy.webp"
            }
          },
          {
            "type": "text",
            "prop": "Looking ahead, we are excited about the possibilities. We are constantly working to improve our services and are committed to making a difference in the lives of those with learning differences. We have seen firsthand the transformative power of early diagnosis and support, and we are motivated to make this accessible to as many individuals as possible."
          },
          {
            "type": "text",
            "prop": "At Polygon, we are more than just a company. We are a community of individuals dedicated to empowering those with learning differences. We strive to bring about change, both in the outcomes for our clients and in societal perceptions of learning differences."
          },
          {
            "type": "text",
            "prop": "And as I continue on this journey, I am reminded every day of why we started Polygon. It's not just about evaluations or accommodations or accessibility. It's about enabling every individual to reach their full potential. It's about celebrating the polygons in a world built for circles."
          },
          {
            "type": "text",
            "prop": "As we move forward, we're not just building a company. We're building a movement. And we invite you to join us on this exciting journey. Together, we can make a difference."
          },
          {
            "type": "image",
            "prop": {
              "altText": "Polygon Psychology Group website screenshot",
              "source": "https://cdn.merylldindin.com/assets/polygon-header.webp",
              "lazySource": "https://cdn.merylldindin.com/assets/polygon-header-lazy.webp"
            }
          },
          {
            "type": "headline",
            "prop": {
              "level": 2,
              "text": "References",
              "typography": "headline-3 my-6"
            }
          },
          {
            "type": "headline",
            "prop": {
              "level": 3,
              "text": "Social Networks",
              "typography": "text-lexend-deca headline-6"
            }
          },
          {
            "type": "socials",
            "prop": [
              {
                "ariaLabel": "Website of Polygon",
                "icon": "WEB",
                "rel": "nofollow noopener external",
                "target": "_blank",
                "to": "https://hellopolygon.com/"
              },
              {
                "ariaLabel": "Facebook page of Polygon",
                "icon": "FACEBOOK",
                "rel": "nofollow noopener noreferrer external",
                "target": "_blank",
                "to": "https://www.facebook.com/hellopolygon/"
              },
              {
                "ariaLabel": "X page of Polygon",
                "icon": "TWITTER",
                "rel": "nofollow noopener noreferrer external",
                "target": "_blank",
                "to": "https://x.com/hello_polygon/"
              },
              {
                "ariaLabel": "Instagram page of Polygon",
                "icon": "INSTAGRAM",
                "rel": "nofollow noopener noreferrer external",
                "target": "_blank",
                "to": "https://www.instagram.com/hello_polygon/"
              },
              {
                "ariaLabel": "LinkedIn page of Polygon",
                "icon": "LINKEDIN",
                "rel": "nofollow noopener noreferrer external",
                "target": "_blank",
                "to": "https://www.linkedin.com/company/hello-polygon/"
              },
              {
                "ariaLabel": "Github page of Polygon",
                "icon": "GITHUB",
                "rel": "nofollow noopener noreferrer external",
                "target": "_blank",
                "to": "https://github.com/hello-polygon"
              }
            ]
          },
          {
            "type": "headline",
            "prop": {
              "level": 3,
              "text": "Blog Posts",
              "typography": "text-lexend-deca headline-6 my-6"
            }
          },
          {
            "type": "article",
            "prop": {
              "href": "https://hellopolygon.medium.com/adhd-explained-6bc82539088d",
              "title": "ADHD Explained",
              "description": "Considering that global prevalence estimates range from 5-10%, ADHD is remarkably poorly understood and vaguely described."
            }
          },
          {
            "type": "article",
            "prop": {
              "href": "https://hellopolygon.medium.com/how-every-child-should-learn-to-read-an-evidence-based-guide-ca872a2d5143",
              "title": "How Every Child Should Learn to Read: An Evidence-Based Guide",
              "description": "What is the most effective reading program for children? What age should they start? Do Dyslexic children learn differently?"
            }
          },
          {
            "type": "article",
            "prop": {
              "href": "https://hellopolygon.medium.com/the-benefits-of-online-testing-63007f01126d",
              "title": "The Benefits of Online Testing",
              "description": "What are the differences between online and in-person testing for Dyslexia, ADHD, and Other Learning Differences?"
            }
          },
          {
            "type": "article",
            "prop": {
              "href": "https://hellopolygon.medium.com/dyslexia-explained-4565a842b654",
              "title": "Dyslexia Explained",
              "description": "What is Dyslexia? How is it diagnosed? And how do you effectively mitigate it? Everything you need to know."
            }
          },
          {
            "type": "article",
            "prop": {
              "href": "https://hellopolygon.medium.com/dysgraphia-explained-431c285c562b",
              "title": "Dysgraphia Explained",
              "description": "Ever wondered what dysgraphia and an SLD in writing are? We discuss definitions, symptoms, and testing."
            }
          },
          {
            "type": "article",
            "prop": {
              "href": "https://hellopolygon.medium.com/the-science-of-reading-fc1cc4ca1bcb",
              "title": "The Science of Reading",
              "description": "Over 40 years of research have demonstrated that one reading program is the most effective. Moreover, most other programs are ineffective."
            }
          },
          {
            "type": "article",
            "prop": {
              "href": "https://hellopolygon.medium.com/dyscalculia-explained-ed63f74c36",
              "title": "Dyscalculia Explained",
              "description": "Ever wondered what dyscalculia and an SLD in math are? We discuss definitions, symptoms, and testing."
            }
          },
          {
            "type": "article",
            "prop": {
              "href": "https://hellopolygon.medium.com/adhd-in-women-4dbc9221bb71",
              "title": "ADHD in Women",
              "description": "ADHD has traditionally been believed to be much more common in boys than girls, but there is growing concern that the discrepancy is largely due to underdiagnosis."
            }
          },
          {
            "type": "article",
            "prop": {
              "href": "https://hellopolygon.medium.com/dyslexia-testing-1cdff0405716",
              "title": "Dyslexia Testing",
              "description": "How do you test for dyslexia and an SLD in reading?"
            }
          },
          {
            "type": "article",
            "prop": {
              "href": "https://hellopolygon.medium.com/dyscalculia-test-fca10b34a122",
              "title": "Dyscalculia Test",
              "description": "How do you test for dyscalculia and an SLD in math?"
            }
          },
          {
            "type": "article",
            "prop": {
              "href": "https://hellopolygon.medium.com/adhd-medication-71e980855763",
              "title": "ADHD Medication",
              "description": "Precaution should always be applied when taking stimulants, as studies by no means rule out potential negative side effects."
            }
          },
          {
            "type": "article",
            "prop": {
              "href": "https://hellopolygon.medium.com/what-is-neuropsychological-testing-cf240c80d16b",
              "title": "What Is Neuropsychological Testing?",
              "description": "What is neuropsychological testing, and how is it different from other types of psychological testing?"
            }
          },
          {
            "type": "article",
            "prop": {
              "href": "https://hellopolygon.medium.com/dyslexia-symptoms-f305b4db2c6f",
              "title": "Dyslexia Symptoms",
              "description": "Looking for a dyslexia test? Check out Polygon!"
            }
          },
          {
            "type": "article",
            "prop": {
              "href": "https://hellopolygon.medium.com/adhd-and-the-medicalization-of-childhood-8bf7c6398ca4",
              "title": "ADHD and the Medicalization of Childhood",
              "description": "We ask elementary school children to sit quietly and focus on school for ten hours per day only to label them disruptive or disabled for failing to do so."
            }
          },
          {
            "type": "headline",
            "prop": {
              "level": 3,
              "text": "Press Releases",
              "typography": "text-lexend-deca headline-6 my-6"
            }
          },
          {
            "type": "article",
            "prop": {
              "href": "https://bigideascontest.org/2019/05/02/2019bigideaswinners/",
              "title": "Big Ideas 2019 Winners Feature Thrive Education",
              "description": "Thrive Education, a UC Berkeley project, is highlighted in the Big Ideas Contest winners list for their adaptive platform aiding dyslexic students."
            }
          },
          {
            "type": "article",
            "prop": {
              "href": "https://www.nataliesandman.com/posts/our-investment-in-polygon",
              "title": "Our Investment in Polygon by Natalie Sandman",
              "description": "Natalie Sandman details Spark Capital's investment in Polygon, highlighting the urgent need for accessible learning difference evaluations."
            }
          },
          {
            "type": "article",
            "prop": {
              "href": "https://dot.la/polygon-adhd-dyslexia-test-2657357820.html",
              "title": "Polygon: New Approach to Detect ADHD & Dyslexia Early",
              "description": "Polygon, a startup raising $4m, aims to tackle the challenges in early detection of ADHD and dyslexia, traditionally dependent on parental or teacher intervention."
            }
          },
          {
            "type": "article",
            "prop": {
              "href": "https://labusinessjournal.com/technology/polygon-sees-better-way-to-diagnoses/",
              "title": "Polygon: Advancing ADHD & Dyslexia Diagnoses | LA Business Journal",
              "description": "Santa Monica-based Polygon innovates a better diagnosis and support system for individuals with ADHD and dyslexia."
            }
          },
          {
            "type": "article",
            "prop": {
              "href": "https://www.citybiz.co/article/267460/polygon-raises-3-6-million-in-seed-funding/",
              "title": "Polygon Raises $3.6 Million in Seed Funding",
              "description": "CityBiz covers Polygon's $3.6 million seed funding round to expand remote learning differences evaluation services."
            }
          },
          {
            "type": "article",
            "prop": {
              "href": "https://ikeepsafe.org/polygon-earns-ikeepsafe-coppa-safe-harbor-certification/",
              "title": "Polygon Earns iKeepSafe COPPA Safe Harbor Certification",
              "description": "Polygon, a psychology practice focused on learning differences, has received the iKeepSafe COPPA badge, indicating its commitment to child online privacy protection standards."
            }
          },
          {
            "type": "article",
            "prop": {
              "href": "https://drata.com/blog/uncomplicated-podcast-episode-9",
              "title": "Compliance Uncomplicated: Security-First Culture With Polygon",
              "description": "Drata podcast featuring Polygon's approach to building a security-first culture and achieving compliance for their learning differences platform."
            }
          },
          {
            "type": "article",
            "prop": {
              "href": "https://www.youtube.com/watch?v=Kh5ez7GJP3M&ab_channel=ZeroHiccupWay",
              "title": "What is Hello Polygon? | Zero Hiccup Talks",
              "description": "Meryll Dindin discusses Polygon's mission to support individuals with dyslexia and ADHD through accessible remote evaluations."
            }
          }
        ]
      }
    }
  ]
}
