{
  "layout": "scrolled",
  "schema": {
    "type": "blogPosting",
    "prop": {
      "dateModified": "2023-06-07",
      "datePublished": "2023-06-07",
      "keywords": "dillygence, manufacturing intelligence, industry 4.0, saas twins, factory performance optimization"
    }
  },
  "head": {
    "canonical": "/hustle/dillygence/",
    "title": "Dillygence: Pioneering the Future of Manufacturing Intelligence | Meryll Dindin",
    "description": "Follow a riveting exploration of Dillygence, a bootstrap venture revolutionizing manufacturing with advanced technology. Discover its impactful journey.",
    "thumbnail": "https://cdn.merylldindin.com/thumbnails/dillygence.webp",
    "thumbnailAlt": "Dillygence website screenshot"
  },
  "components": [
    {
      "name": "HEADER_ARTICLE",
      "id": "home-section",
      "props": {
        "background": {
          "altText": "Dillygence website screenshot",
          "source": "https://cdn.merylldindin.com/assets/dillygence-header.webp",
          "lazySource": "https://cdn.merylldindin.com/assets/dillygence-header-lazy.webp",
          "mobile": "https://cdn.merylldindin.com/assets/dillygence-header-mobile.webp",
          "lazyMobile": "https://cdn.merylldindin.com/assets/dillygence-header-mobile-lazy.webp"
        },
        "content": [
          {
            "type": "headline",
            "prop": {
              "level": 1,
              "text": "Redefining Manufacturing Intelligence with Dillygence",
              "typography": "text-cartesian headline-2 mb-6"
            }
          },
          {
            "type": "headline",
            "prop": {
              "level": 2,
              "text": "Last Edited on June 07, 2023",
              "typography": "text-lexend-deca headline-6 mb-6"
            }
          },
          {
            "type": "text",
            "prop": "As one of the first members of the Dillygence team, I've had the privilege of witnessing firsthand the astounding journey of a bootstrap company flourishing into a force to reckon with. Nelson Mandela once remarked, “I never lose. I either win or I learn.” His wise words have become a guiding principle for us at Dillygence, a beacon lighting our path through the exhilarating world of entrepreneurship."
          },
          {
            "type": "text",
            "prop": "In our early days, we dared to envision a seemingly colossal mission—to bring manufacturing intelligence into factories, optimizing their operations to maximize their profits. Harnessing the potential of Industry 4.0—the easy access to data, the advanced capabilities of artificial intelligence, and the efficacy of modern visualization tools—we aspired to transform the manufacturing landscape."
          },
          {
            "type": "text",
            "prop": "Our ambition was not confined to carving out a niche in the market for ourselves. Rather, it centered on pioneering solutions that had seldom been tested successfully before. We aimed to dramatically improve factory performance by leveraging SaaS twins, allowing clients to visualize, analyze, and decide effectively. Being a bootstrap company meant limited resources and funding, but these constraints never deterred us. Instead, they fueled our determination, making our subsequent success even more gratifying."
          },
          {
            "type": "youtube",
            "prop": "https://www.youtube.com/embed/Bxj4L24fFDs"
          },
          {
            "type": "text",
            "prop": "Our entrepreneurial journey started without the glamour of venture capital funding or media fanfare. We embarked on our mission with nothing more than faith in our idea and the will to make it happen. That's the beauty of bootstrapping—you own your idea completely, shaping it with your own blood, sweat, and tears. It's a challenging yet empowering experience, one that makes you realize the enormous potential that lies within determination and hard work."
          },
          {
            "type": "text",
            "prop": "In the beginning, we were just a small team with an ambitious goal. Despite the constraints, we believed in our ability to make a substantial difference in the manufacturing industry. Our focus was unwavering: to develop solutions that would maximize profit for our clients by reducing capital and operational expenditures. We put our expertise and innovative thinking into developing customizable solutions that could optimize factories in any state—be it in the design/reconfiguration phase, ramp-up, or production."
          },
          {
            "type": "text",
            "prop": "The journey wasn't without its hurdles, of course. Yet, every challenge was an opportunity to learn, grow, and improve. In the face of adversity, our team's resilience shone through. We drew strength from our shared mission, always remembering that our ultimate aim was not just to achieve success, but to ensure that our clients were truly happy with our work."
          },
          {
            "type": "text",
            "prop": "Each victory, no matter how small, was a validation of our efforts. From our involvement in the design phase of a factory, which resulted in an average of 20% saving on investment, to aiding a factory operating at a steady state increase production at minimum cost, our solutions were creating tangible impacts."
          },
          {
            "type": "image",
            "prop": {
              "altText": "Testimonial from Dillygence client at Stellantis",
              "source": "https://cdn.merylldindin.com/assets/dillygence-stellantis.webp",
              "lazySource": "https://cdn.merylldindin.com/assets/dillygence-stellantis-lazy.webp"
            }
          },
          {
            "type": "text",
            "prop": "Over the years, our team grew from a handful of dedicated individuals to a family of 15. Each new member brought their unique expertise, diverse backgrounds, and fresh perspectives, adding to our vibrant tapestry of ideas and skills. Most importantly, everyone shared a deep understanding of factory physics, further strengthening our collective competency."
          },
          {
            "type": "text",
            "prop": "The team at Dillygence has always been more than just a group of colleagues. We're a tight-knit community, bound by our shared commitment to learning and achieving. We put great effort into developing each other's expertise, knowing that our collective growth contributes to the success of Dillygence."
          },
          {
            "type": "text",
            "prop": "Reflecting on our journey, I am filled with immense gratitude. I feel privileged to be part of an innovative venture that's shaping the future of manufacturing. Every day at Dillygence is a new adventure, filled with opportunities for growth, learning, and success."
          },
          {
            "type": "image",
            "prop": {
              "altText": "List of clients at Dillygence",
              "source": "https://cdn.merylldindin.com/assets/dillygence-projects.webp",
              "lazySource": "https://cdn.merylldindin.com/assets/dillygence-projects-lazy.webp"
            }
          },
          {
            "type": "text",
            "prop": "In conclusion, our journey at Dillygence has been an extraordinary one—a rollercoaster ride of learning, winning, and making a difference. We've come a long way, but there's still a long way to go. With the relentless determination of our team and the revolutionary solutions we've developed, I am confident that Dillygence will continue to pave the way for an innovative future in the manufacturing industry."
          },
          {
            "type": "text",
            "prop": "Dillygence is more than just a company—it's a testament to the power of perseverance, innovation, and teamwork. Here's to many more years of bringing manufacturing intelligence into factories, maximizing profits, and exceeding our clients' expectations."
          },
          {
            "type": "headline",
            "prop": {
              "level": 2,
              "text": "References",
              "typography": "headline-3 my-6"
            }
          },
          {
            "type": "headline",
            "prop": {
              "level": 3,
              "text": "Social Networks",
              "typography": "text-lexend-deca headline-6 mb-6"
            }
          },
          {
            "type": "socials",
            "prop": [
              {
                "ariaLabel": "Website of Dillygence",
                "icon": "WEB",
                "rel": "nofollow noopener external",
                "target": "_blank",
                "to": "https://dillygence.com/"
              },
              {
                "ariaLabel": "Twitter page of Polygon",
                "icon": "TWITTER",
                "rel": "nofollow noopener noreferrer external",
                "target": "_blank",
                "to": "https://twitter.com/Dillygence1/"
              },
              {
                "ariaLabel": "LinkedIn page of Dillygence",
                "icon": "LINKEDIN",
                "rel": "nofollow noopener noreferrer external",
                "target": "_blank",
                "to": "https://www.linkedin.com/company/dillygence/"
              },
              {
                "ariaLabel": "Github page of Dillygence",
                "icon": "GITHUB",
                "rel": "nofollow noopener noreferrer external",
                "target": "_blank",
                "to": "https://github.com/dillygence"
              }
            ]
          },
          {
            "type": "headline",
            "prop": {
              "level": 3,
              "text": "Science Contributions",
              "typography": "text-lexend-deca headline-6 my-6"
            }
          },
          {
            "type": "article",
            "prop": {
              "href": "https://patents.google.com/patent/LU102785B1/",
              "title": "Simulation process of a manufacturing system",
              "description": "An AI-based method for simulating manufacturing systems, utilizing machine learning to compute station data and test configurations for optimized production."
            }
          },
          {
            "type": "article",
            "prop": {
              "href": "https://patents.google.com/patent/EP4075330A1/",
              "title": "Monitoring process of a manufacturing system",
              "description": "An AI-driven monitoring process for manufacturing systems, using video data and convolutional neural networks to model arm movements, optimize operations and alert when predefined conditions are met."
            }
          },
          {
            "type": "headline",
            "prop": {
              "level": 3,
              "text": "Press Releases",
              "typography": "text-lexend-deca headline-6 my-6"
            }
          },
          {
            "type": "article",
            "prop": {
              "href": "https://www.lafrenchfab.fr/entreprise/dillygence/",
              "title": "DILLYGENCE - La French Fab",
              "description": "Unlock operational excellence with Dillygence's innovative SaaS solutions. Utilizing MIT research, we optimize your value chain, offering factory redesign and a free Industry 4.0 maturity evaluation."
            }
          },
          {
            "type": "article",
            "prop": {
              "href": "https://www.7joursaclermont.fr/le-futur-de-lindustrie-sesquisse-au-bivouac/?cn-reloaded=1",
              "title": "The future of industry takes shape at Bivouac | 7 Jours à Clermont",
              "description": "Five startups recently joined the Clermont-Ferrand incubator to work with local manufacturers. The aim: to offer them innovations to improve efficiency. Here are the details."
            }
          },
          {
            "type": "article",
            "prop": {
              "href": "https://www.clermontauvergneinnovation.com/lebivouac/experiences/industrie-du-futur-une-promotion-riche-et-de-belles-realisations/",
              "title": "Industry of the future: a rich promotion and some fine achievements - Le Bivouac",
              "description": "The #Industriedufutur class has just completed its 6 months of acceleration with the Bivouac. Here's a look back at a class rich in achievements, despite the particular health context."
            }
          },
          {
            "type": "article",
            "prop": {
              "href": "https://www.usinenouvelle.com/article/publiscopie-des-jumeaux-numeriques-pour-analyser-et-optimiser-la-performance-des-usines.N2026467",
              "title": "Publiscopie : Digital twins to analyze and optimize factory performance",
              "description": "Explore Dillygence's digital twins on Usine Nouvelle, revolutionizing Industry 4.0 factory operations. Utilizing their expertise and MIT research, Dillygence offers a SaaS solution to analyze and enhance the value chain, driving profitable improvements and increased production."
            }
          },
          {
            "type": "article",
            "prop": {
              "href": "https://www.lanouvellerepublique.fr/economie/industrie-4-0-l-urgence-d-innover",
              "title": "Industry 4.0: The Urgency to Innovate - A Webinar Series",
              "description": "Join Bpifrance Université's webinar series on Industry 4.0. Engage with experts, explore transformation areas, and seize innovation opportunities."
            }
          },
          {
            "type": "article",
            "prop": {
              "href": "https://www.bpifrance-universite.fr/formation/industrie-4-0-transformez-votre-outil-de-production-de-la-fragilite-a-lagilite/",
              "title": "Online training Industry 4.0: Transform your production tool. From fragility to agility! - Bpifrance University",
              "description": "Industrie 4.0: transform your production tool. From fragility to agility! - Free online training for entrepreneurs"
            }
          }
        ]
      }
    }
  ]
}
